<?xml version="1.0" ?>
<net name="icnet-camvid-ava-0001" version="10">
	<layers>
		<layer id="0" name="data" type="Parameter" version="opset1">
			<data element_type="f16" shape="1,3,720,960"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>960</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="image_preprocess/truediv/reciprocal_14400/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1,3,1,1" size="6"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="image_preprocess/truediv" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>960</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>960</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="image_preprocess/sub/neg_14406/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="6" shape="1,3,1,1" size="6"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="image_preprocess/sub" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>960</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>960</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="icnet_features/data_sub2_1/Cast_122598_const" type="Const" version="opset1">
			<data element_type="i64" offset="12" shape="2" size="16"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="icnet_features/data_sub2_1" type="Interpolate" version="opset1">
			<data align_corners="1" antialias="0" axes="2,3" mode="linear" pads_begin="0" pads_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>960</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>360</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="icnet_features/conv1_1_3x3_s2_bn_2/FusedBatchNorm/mean/Fused_Mul_1620516207_const" type="Const" version="opset1">
			<data element_type="f16" offset="28" shape="64,3,3,3" size="3456"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="icnet_features/conv1_1_3x3_s2_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>360</dim>
					<dim>480</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>180</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="data_add_1514015145/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="3484" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="icnet_features/conv1_1_3x3_s2_bn_2/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>180</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>180</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="icnet_features/conv1_1_3x3_s2_bn_3/conv1_1_3x3_s2_bn" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>180</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>180</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="icnet_features/conv1_2_3x3_bn_2/FusedBatchNorm/mean/Fused_Mul_1620916211_const" type="Const" version="opset1">
			<data element_type="f16" offset="3612" shape="64,64,3,3" size="73728"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="icnet_features/conv1_2_3x3_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>180</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>180</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="data_add_1514815153/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="77340" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="icnet_features/conv1_2_3x3_bn_2/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>180</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>180</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="icnet_features/conv1_2_3x3_bn_3/conv1_2_3x3_bn" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>180</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>180</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="icnet_features/conv1_3_3x3_bn_2/FusedBatchNorm/mean/Fused_Mul_1621316215_const" type="Const" version="opset1">
			<data element_type="f16" offset="77468" shape="128,64,3,3" size="147456"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="icnet_features/conv1_3_3x3_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>180</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="data_add_1515615161/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="224924" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="icnet_features/conv1_3_3x3_bn_2/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="icnet_features/conv1_3_3x3_bn_3/conv1_3_3x3_bn" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="icnet_features/pool1_3x3_s2_1/MaxPool" type="MaxPool" version="opset1">
			<data kernel="3,3" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="icnet_features/conv2_1_1x1_proj_bn_1/FusedBatchNorm/mean/Fused_Mul_1622916231_const" type="Const" version="opset1">
			<data element_type="f16" offset="225180" shape="256,128,1,1" size="65536"/>
			<output>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="icnet_features/conv2_1_1x1_proj_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="data_add_1518815193/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="290716" shape="1,256,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="icnet_features/conv2_1_1x1_proj_bn_1/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="icnet_features/ResizeBilinear_19/Cast_122612_const" type="Const" version="opset1">
			<data element_type="i64" offset="291228" shape="2" size="16"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="icnet_features/ResizeBilinear_19" type="Interpolate" version="opset1">
			<data align_corners="0" antialias="0" axes="2,3" mode="linear" pads_begin="0" pads_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="icnet_features/conv2_1_1x1_reduce_bn_2/FusedBatchNorm/mean/Fused_Mul_1621716219_const" type="Const" version="opset1">
			<data element_type="f16" offset="291244" shape="64,128,1,1" size="16384"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="icnet_features/conv2_1_1x1_reduce_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="data_add_1516415169/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="307628" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="icnet_features/conv2_1_1x1_reduce_bn_2/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="icnet_features/conv2_1_1x1_reduce_bn_3/conv2_1_1x1_reduce_bn" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="icnet_features/conv2_1_3x3_bn_2/FusedBatchNorm/mean/Fused_Mul_1622116223_const" type="Const" version="opset1">
			<data element_type="f16" offset="307756" shape="64,64,3,3" size="73728"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="icnet_features/conv2_1_3x3_1/Conv2D" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="data_add_1517215177/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="381484" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="icnet_features/conv2_1_3x3_bn_2/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="icnet_features/conv2_1_3x3_bn_3/conv2_1_3x3_bn" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="icnet_features/conv2_1_1x1_increase_bn_1/FusedBatchNorm/mean/Fused_Mul_1622516227_const" type="Const" version="opset1">
			<data element_type="f16" offset="381612" shape="256,64,1,1" size="32768"/>
			<output>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="icnet_features/conv2_1_1x1_increase_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="data_add_1518015185/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="414380" shape="1,256,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="icnet_features/conv2_1_1x1_increase_bn_1/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="icnet_features/conv2_1_1/sum_1" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="icnet_features/conv2_1/relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="icnet_features/ResizeBilinear_20/Cast_122600_const" type="Const" version="opset1">
			<data element_type="i64" offset="291228" shape="2" size="16"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="icnet_features/ResizeBilinear_20" type="Interpolate" version="opset1">
			<data align_corners="0" antialias="0" axes="2,3" mode="linear" pads_begin="0" pads_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="icnet_features/conv2_2_1x1_reduce_bn_2/FusedBatchNorm/mean/Fused_Mul_1623316235_const" type="Const" version="opset1">
			<data element_type="f16" offset="414892" shape="64,256,1,1" size="32768"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="icnet_features/conv2_2_1x1_reduce_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="data_add_1519615201/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="447660" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="icnet_features/conv2_2_1x1_reduce_bn_2/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="icnet_features/conv2_2_1x1_reduce_bn_3/conv2_2_1x1_reduce_bn" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="icnet_features/conv2_2_3x3_bn_2/FusedBatchNorm/mean/Fused_Mul_1623716239_const" type="Const" version="opset1">
			<data element_type="f16" offset="447788" shape="64,64,3,3" size="73728"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="icnet_features/conv2_2_3x3_1/Conv2D" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="data_add_1520415209/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="521516" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="icnet_features/conv2_2_3x3_bn_2/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="icnet_features/conv2_2_3x3_bn_3/conv2_2_3x3_bn" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="icnet_features/conv2_2_1x1_increase_bn_1/FusedBatchNorm/mean/Fused_Mul_1624116243_const" type="Const" version="opset1">
			<data element_type="f16" offset="521644" shape="256,64,1,1" size="32768"/>
			<output>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="icnet_features/conv2_2_1x1_increase_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="data_add_1521215217/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="554412" shape="1,256,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="icnet_features/conv2_2_1x1_increase_bn_1/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="icnet_features/conv2_2_1/sum_1" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="icnet_features/conv2_2/relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="icnet_features/ResizeBilinear_21/Cast_122630_const" type="Const" version="opset1">
			<data element_type="i64" offset="291228" shape="2" size="16"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="icnet_features/ResizeBilinear_21" type="Interpolate" version="opset1">
			<data align_corners="0" antialias="0" axes="2,3" mode="linear" pads_begin="0" pads_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="icnet_features/conv2_3_1x1_reduce_bn_2/FusedBatchNorm/mean/Fused_Mul_1624516247_const" type="Const" version="opset1">
			<data element_type="f16" offset="554924" shape="64,256,1,1" size="32768"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="icnet_features/conv2_3_1x1_reduce_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="data_add_1522015225/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="587692" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="icnet_features/conv2_3_1x1_reduce_bn_2/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="icnet_features/conv2_3_1x1_reduce_bn_3/conv2_3_1x1_reduce_bn" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="icnet_features/conv2_3_3x3_bn_2/FusedBatchNorm/mean/Fused_Mul_1624916251_const" type="Const" version="opset1">
			<data element_type="f16" offset="587820" shape="64,64,3,3" size="73728"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="icnet_features/conv2_3_3x3_1/Conv2D" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="data_add_1522815233/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="661548" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="icnet_features/conv2_3_3x3_bn_2/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="icnet_features/conv2_3_3x3_bn_3/conv2_3_3x3_bn" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="icnet_features/conv2_3_1x1_increase_bn_1/FusedBatchNorm/mean/Fused_Mul_1625316255_const" type="Const" version="opset1">
			<data element_type="f16" offset="661676" shape="256,64,1,1" size="32768"/>
			<output>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="icnet_features/conv2_3_1x1_increase_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="data_add_1523615241/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="694444" shape="1,256,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="icnet_features/conv2_3_1x1_increase_bn_1/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="icnet_features/conv2_3_1/sum_1" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="icnet_features/conv2_3/relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="icnet_features/conv3_1_1x1_proj_bn_1/FusedBatchNorm/mean/Fused_Mul_1626916271_const" type="Const" version="opset1">
			<data element_type="f16" offset="694956" shape="512,256,1,1" size="262144"/>
			<output>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="icnet_features/conv3_1_1x1_proj_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="data_add_1526815273/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="957100" shape="1,512,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="icnet_features/conv3_1_1x1_proj_bn_1/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="icnet_features/ResizeBilinear_22/Cast_122626_const" type="Const" version="opset1">
			<data element_type="i64" offset="958124" shape="2" size="16"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="icnet_features/ResizeBilinear_22" type="Interpolate" version="opset1">
			<data align_corners="0" antialias="0" axes="2,3" mode="linear" pads_begin="0" pads_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="icnet_features/conv3_1_1x1_reduce_bn_2/FusedBatchNorm/mean/Fused_Mul_1625716259_const" type="Const" version="opset1">
			<data element_type="f16" offset="958140" shape="128,256,1,1" size="65536"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="icnet_features/conv3_1_1x1_reduce_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>90</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="data_add_1524415249/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1023676" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="icnet_features/conv3_1_1x1_reduce_bn_2/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="icnet_features/conv3_1_1x1_reduce_bn_3/conv3_1_1x1_reduce_bn" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="icnet_features/conv3_1_3x3_bn_2/FusedBatchNorm/mean/Fused_Mul_1626116263_const" type="Const" version="opset1">
			<data element_type="f16" offset="1023932" shape="128,128,3,3" size="294912"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="icnet_features/conv3_1_3x3_1/Conv2D" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="data_add_1525215257/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1318844" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="icnet_features/conv3_1_3x3_bn_2/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="icnet_features/conv3_1_3x3_bn_3/conv3_1_3x3_bn" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="icnet_features/conv3_1_1x1_increase_bn_1/FusedBatchNorm/mean/Fused_Mul_1626516267_const" type="Const" version="opset1">
			<data element_type="f16" offset="1319100" shape="512,128,1,1" size="131072"/>
			<output>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="icnet_features/conv3_1_1x1_increase_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="data_add_1526015265/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1450172" shape="1,512,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="icnet_features/conv3_1_1x1_increase_bn_1/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="icnet_features/conv3_1_1/sum_1" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="icnet_features/conv3_1/relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="icnet_features/conv3_1_sub4_1/Cast_122620_const" type="Const" version="opset1">
			<data element_type="i64" offset="1451196" shape="2" size="16"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="icnet_features/conv3_1_sub4_1" type="Interpolate" version="opset1">
			<data align_corners="1" antialias="0" axes="2,3" mode="linear" pads_begin="0" pads_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>45</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>23</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="icnet_features/ResizeBilinear_23/Cast_122602_const" type="Const" version="opset1">
			<data element_type="i64" offset="1451196" shape="2" size="16"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="icnet_features/ResizeBilinear_23" type="Interpolate" version="opset1">
			<data align_corners="0" antialias="0" axes="2,3" mode="linear" pads_begin="0" pads_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>23</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>23</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="icnet_features/conv3_2_1x1_reduce_bn_2/FusedBatchNorm/mean/Fused_Mul_1627716279_const" type="Const" version="opset1">
			<data element_type="f16" offset="1451212" shape="128,512,1,1" size="131072"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="icnet_features/conv3_2_1x1_reduce_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>23</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>23</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="data_add_1528415289/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1582284" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="icnet_features/conv3_2_1x1_reduce_bn_2/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>23</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>23</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="icnet_features/conv3_2_1x1_reduce_bn_3/conv3_2_1x1_reduce_bn" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>23</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>23</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="icnet_features/conv3_2_3x3_bn_2/FusedBatchNorm/mean/Fused_Mul_1628116283_const" type="Const" version="opset1">
			<data element_type="f16" offset="1582540" shape="128,128,3,3" size="294912"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="icnet_features/conv3_2_3x3_1/Conv2D" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>23</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>23</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="data_add_1529215297/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="1877452" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
